name: "SHG_MPII_256x256_deploy"
input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 256
  dim: 256
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv1_scale"
  type: "EltwiseAffine"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1s"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1s"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire2/squeeze1x1"
  type: "Convolution"
  bottom: "pool1s"
  top: "fire2/squeeze1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire2/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire2/squeeze1x1"
  top: "fire2/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire2/squeeze1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire2/squeeze1x1"
  top: "fire2/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire2/squeeze1x1_relu"
  type: "ReLU"
  bottom: "fire2/squeeze1x1"
  top: "fire2/squeeze1x1"
}
layer {
  name: "fire2/expand1x1"
  type: "Convolution"
  bottom: "fire2/squeeze1x1"
  top: "fire2/expand1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire2/expand1x1_bn"
  type: "BatchNorm"
  bottom: "fire2/expand1x1"
  top: "fire2/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire2/expand1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire2/expand1x1"
  top: "fire2/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire2/expand1x1_relu"
  type: "ReLU"
  bottom: "fire2/expand1x1"
  top: "fire2/expand1x1"
}
layer {
  name: "fire2/expand3x3"
  type: "Convolution"
  bottom: "fire2/squeeze1x1"
  top: "fire2/expand3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire2/expand3x3_bn"
  type: "BatchNorm"
  bottom: "fire2/expand3x3"
  top: "fire2/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire2/expand3x3_scale"
  type: "EltwiseAffine"
  bottom: "fire2/expand3x3"
  top: "fire2/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire2/expand3x3_relu"
  type: "ReLU"
  bottom: "fire2/expand3x3"
  top: "fire2/expand3x3"
}
layer {
  name: "fire2/concat"
  type: "Concat"
  bottom: "fire2/expand1x1"
  bottom: "fire2/expand3x3"
  top: "fire2/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "fire3/squeeze1x1"
  type: "Convolution"
  bottom: "fire2/concat"
  top: "fire3/squeeze1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire3/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire3/squeeze1x1"
  top: "fire3/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire3/squeeze1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire3/squeeze1x1"
  top: "fire3/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire3/squeeze1x1_relu"
  type: "ReLU"
  bottom: "fire3/squeeze1x1"
  top: "fire3/squeeze1x1"
}
layer {
  name: "fire3/expand1x1"
  type: "Convolution"
  bottom: "fire3/squeeze1x1"
  top: "fire3/expand1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire3/expand1x1_bn"
  type: "BatchNorm"
  bottom: "fire3/expand1x1"
  top: "fire3/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire3/expand1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire3/expand1x1"
  top: "fire3/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire3/expand1x1_relu"
  type: "ReLU"
  bottom: "fire3/expand1x1"
  top: "fire3/expand1x1"
}
layer {
  name: "fire3/expand3x3"
  type: "Convolution"
  bottom: "fire3/squeeze1x1"
  top: "fire3/expand3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire3/expand3x3_bn"
  type: "BatchNorm"
  bottom: "fire3/expand3x3"
  top: "fire3/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire3/expand3x3_scale"
  type: "EltwiseAffine"
  bottom: "fire3/expand3x3"
  top: "fire3/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire3/expand3x3_relu"
  type: "ReLU"
  bottom: "fire3/expand3x3"
  top: "fire3/expand3x3"
}
layer {
  name: "fire3/concat"
  type: "Concat"
  bottom: "fire3/expand1x1"
  bottom: "fire3/expand3x3"
  top: "fire3/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "fire3/concat"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire4/squeeze1x1"
  type: "Convolution"
  bottom: "pool3"
  top: "fire4/squeeze1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire4/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire4/squeeze1x1"
  top: "fire4/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire4/squeeze1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire4/squeeze1x1"
  top: "fire4/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire4/squeeze1x1_relu"
  type: "ReLU"
  bottom: "fire4/squeeze1x1"
  top: "fire4/squeeze1x1"
}
layer {
  name: "fire4/expand1x1"
  type: "Convolution"
  bottom: "fire4/squeeze1x1"
  top: "fire4/expand1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire4/expand1x1_bn"
  type: "BatchNorm"
  bottom: "fire4/expand1x1"
  top: "fire4/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire4/expand1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire4/expand1x1"
  top: "fire4/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire4/expand1x1_relu"
  type: "ReLU"
  bottom: "fire4/expand1x1"
  top: "fire4/expand1x1"
}
layer {
  name: "fire4/expand3x3"
  type: "Convolution"
  bottom: "fire4/squeeze1x1"
  top: "fire4/expand3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire4/expand3x3_bn"
  type: "BatchNorm"
  bottom: "fire4/expand3x3"
  top: "fire4/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire4/expand3x3_scale"
  type: "EltwiseAffine"
  bottom: "fire4/expand3x3"
  top: "fire4/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire4/expand3x3_relu"
  type: "ReLU"
  bottom: "fire4/expand3x3"
  top: "fire4/expand3x3"
}
layer {
  name: "fire4/concat"
  type: "Concat"
  bottom: "fire4/expand1x1"
  bottom: "fire4/expand3x3"
  top: "fire4/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "fire5/squeeze1x1"
  type: "Convolution"
  bottom: "fire4/concat"
  top: "fire5/squeeze1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire5/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire5/squeeze1x1"
  top: "fire5/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire5/squeeze1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire5/squeeze1x1"
  top: "fire5/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire5/squeeze1x1_relu"
  type: "ReLU"
  bottom: "fire5/squeeze1x1"
  top: "fire5/squeeze1x1"
}
layer {
  name: "fire5/expand1x1"
  type: "Convolution"
  bottom: "fire5/squeeze1x1"
  top: "fire5/expand1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire5/expand1x1_bn"
  type: "BatchNorm"
  bottom: "fire5/expand1x1"
  top: "fire5/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire5/expand1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire5/expand1x1"
  top: "fire5/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire5/expand1x1_relu"
  type: "ReLU"
  bottom: "fire5/expand1x1"
  top: "fire5/expand1x1"
}
layer {
  name: "fire5/expand3x3"
  type: "Convolution"
  bottom: "fire5/squeeze1x1"
  top: "fire5/expand3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire5/expand3x3_bn"
  type: "BatchNorm"
  bottom: "fire5/expand3x3"
  top: "fire5/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire5/expand3x3_scale"
  type: "EltwiseAffine"
  bottom: "fire5/expand3x3"
  top: "fire5/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire5/expand3x3_relu"
  type: "ReLU"
  bottom: "fire5/expand3x3"
  top: "fire5/expand3x3"
}
layer {
  name: "fire5/concat"
  type: "Concat"
  bottom: "fire5/expand1x1"
  bottom: "fire5/expand3x3"
  top: "fire5/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "fire5/concat"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fire6/squeeze1x1"
  type: "Convolution"
  bottom: "pool5"
  top: "fire6/squeeze1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire6/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire6/squeeze1x1"
  top: "fire6/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire6/squeeze1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire6/squeeze1x1"
  top: "fire6/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire6/squeeze1x1_relu"
  type: "ReLU"
  bottom: "fire6/squeeze1x1"
  top: "fire6/squeeze1x1"
}
layer {
  name: "fire6/expand1x1"
  type: "Convolution"
  bottom: "fire6/squeeze1x1"
  top: "fire6/expand1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire6/expand1x1_bn"
  type: "BatchNorm"
  bottom: "fire6/expand1x1"
  top: "fire6/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire6/expand1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire6/expand1x1"
  top: "fire6/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire6/expand1x1_relu"
  type: "ReLU"
  bottom: "fire6/expand1x1"
  top: "fire6/expand1x1"
}
layer {
  name: "fire6/expand3x3"
  type: "Convolution"
  bottom: "fire6/squeeze1x1"
  top: "fire6/expand3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire6/expand3x3_bn"
  type: "BatchNorm"
  bottom: "fire6/expand3x3"
  top: "fire6/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire6/expand3x3_scale"
  type: "EltwiseAffine"
  bottom: "fire6/expand3x3"
  top: "fire6/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire6/expand3x3_relu"
  type: "ReLU"
  bottom: "fire6/expand3x3"
  top: "fire6/expand3x3"
}
layer {
  name: "fire6/concat"
  type: "Concat"
  bottom: "fire6/expand1x1"
  bottom: "fire6/expand3x3"
  top: "fire6/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "fire7/squeeze1x1"
  type: "Convolution"
  bottom: "fire6/concat"
  top: "fire7/squeeze1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire7/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire7/squeeze1x1"
  top: "fire7/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire7/squeeze1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire7/squeeze1x1"
  top: "fire7/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire7/squeeze1x1_relu"
  type: "ReLU"
  bottom: "fire7/squeeze1x1"
  top: "fire7/squeeze1x1"
}
layer {
  name: "fire7/expand1x1"
  type: "Convolution"
  bottom: "fire7/squeeze1x1"
  top: "fire7/expand1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire7/expand1x1_bn"
  type: "BatchNorm"
  bottom: "fire7/expand1x1"
  top: "fire7/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire7/expand1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire7/expand1x1"
  top: "fire7/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire7/expand1x1_relu"
  type: "ReLU"
  bottom: "fire7/expand1x1"
  top: "fire7/expand1x1"
}
layer {
  name: "fire7/expand3x3"
  type: "Convolution"
  bottom: "fire7/squeeze1x1"
  top: "fire7/expand3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire7/expand3x3_bn"
  type: "BatchNorm"
  bottom: "fire7/expand3x3"
  top: "fire7/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire7/expand3x3_scale"
  type: "EltwiseAffine"
  bottom: "fire7/expand3x3"
  top: "fire7/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire7/expand3x3_relu"
  type: "ReLU"
  bottom: "fire7/expand3x3"
  top: "fire7/expand3x3"
}
layer {
  name: "fire7/concat"
  type: "Concat"
  bottom: "fire7/expand1x1"
  bottom: "fire7/expand3x3"
  top: "fire7/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "fire8/squeeze1x1"
  type: "Convolution"
  bottom: "fire7/concat"
  top: "fire8/squeeze1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire8/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire8/squeeze1x1"
  top: "fire8/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire8/squeeze1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire8/squeeze1x1"
  top: "fire8/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire8/squeeze1x1_relu"
  type: "ReLU"
  bottom: "fire8/squeeze1x1"
  top: "fire8/squeeze1x1"
}
layer {
  name: "fire8/expand1x1"
  type: "Convolution"
  bottom: "fire8/squeeze1x1"
  top: "fire8/expand1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire8/expand1x1_bn"
  type: "BatchNorm"
  bottom: "fire8/expand1x1"
  top: "fire8/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire8/expand1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire8/expand1x1"
  top: "fire8/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire8/expand1x1_relu"
  type: "ReLU"
  bottom: "fire8/expand1x1"
  top: "fire8/expand1x1"
}
layer {
  name: "fire8/expand3x3"
  type: "Convolution"
  bottom: "fire8/squeeze1x1"
  top: "fire8/expand3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire8/expand3x3_bn"
  type: "BatchNorm"
  bottom: "fire8/expand3x3"
  top: "fire8/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire8/expand3x3_scale"
  type: "EltwiseAffine"
  bottom: "fire8/expand3x3"
  top: "fire8/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire8/expand3x3_relu"
  type: "ReLU"
  bottom: "fire8/expand3x3"
  top: "fire8/expand3x3"
}
layer {
  name: "fire8/concat"
  type: "Concat"
  bottom: "fire8/expand1x1"
  bottom: "fire8/expand3x3"
  top: "fire8/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "fire9/squeeze1x1"
  type: "Convolution"
  bottom: "fire8/concat"
  top: "fire9/squeeze1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire9/squeeze1x1_bn"
  type: "BatchNorm"
  bottom: "fire9/squeeze1x1"
  top: "fire9/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire9/squeeze1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire9/squeeze1x1"
  top: "fire9/squeeze1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire9/squeeze1x1_relu"
  type: "ReLU"
  bottom: "fire9/squeeze1x1"
  top: "fire9/squeeze1x1"
}
layer {
  name: "fire9/expand1x1"
  type: "Convolution"
  bottom: "fire9/squeeze1x1"
  top: "fire9/expand1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire9/expand1x1_bn"
  type: "BatchNorm"
  bottom: "fire9/expand1x1"
  top: "fire9/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire9/expand1x1_scale"
  type: "EltwiseAffine"
  bottom: "fire9/expand1x1"
  top: "fire9/expand1x1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire9/expand1x1_relu"
  type: "ReLU"
  bottom: "fire9/expand1x1"
  top: "fire9/expand1x1"
}
layer {
  name: "fire9/expand3x3"
  type: "Convolution"
  bottom: "fire9/squeeze1x1"
  top: "fire9/expand3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fire9/expand3x3_bn"
  type: "BatchNorm"
  bottom: "fire9/expand3x3"
  top: "fire9/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "fire9/expand3x3_scale"
  type: "EltwiseAffine"
  bottom: "fire9/expand3x3"
  top: "fire9/expand3x3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "fire9/expand3x3_relu"
  type: "ReLU"
  bottom: "fire9/expand3x3"
  top: "fire9/expand3x3"
}
layer {
  name: "fire9/concat"
  type: "Concat"
  bottom: "fire9/expand1x1"
  bottom: "fire9/expand3x3"
  top: "fire9/concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "drop9"
  type: "Dropout"
  bottom: "fire9/concat"
  top: "fire9/concat"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv10"
  type: "Convolution"
  bottom: "fire9/concat"
  top: "conv10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 6
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv10_bn"
  type: "BatchNorm"
  bottom: "conv10"
  top: "conv10"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv10_scale"
  type: "EltwiseAffine"
  bottom: "conv10"
  top: "conv10"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "conv10_relu"
  type: "ReLU"
  bottom: "conv10"
  top: "conv10"
}
layer {
  name: "theta"
  type: "InnerProduct"
  bottom: "conv10"
  top: "theta"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "stn"
  type: "SpatialTransformer"
  bottom: "data"
  bottom: "theta"
  top: "stn"
  st_param {
    to_compute_dU: false
  }
}
layer {
  name: "conv1_b"
  type: "Convolution"
  bottom: "stn"
  top: "conv1_b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn_conv1_b"
  type: "BatchNorm"
  bottom: "conv1_b"
  top: "conv1_b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "scale_conv1_b"
  type: "EltwiseAffine"
  bottom: "conv1_b"
  top: "conv1_b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "conv1_b_relu"
  type: "ReLU"
  bottom: "conv1_b"
  top: "conv1_b"
}
layer {
  name: "res1_branch1"
  type: "Convolution"
  bottom: "conv1_b"
  top: "res1_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1_b_bn"
  type: "BatchNorm"
  bottom: "conv1_b"
  top: "conv1_b_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "conv1_b_bn_scale"
  type: "EltwiseAffine"
  bottom: "conv1_b_bn"
  top: "conv1_b_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "conv1_b_bn_scale_relu"
  type: "ReLU"
  bottom: "conv1_b_bn"
  top: "conv1_b_bn"
}
layer {
  name: "res1_branch2a"
  type: "Convolution"
  bottom: "conv1_b_bn"
  top: "res1_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn1_branch2a"
  type: "BatchNorm"
  bottom: "res1_branch2a"
  top: "res1_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "scale1_branch2a"
  type: "EltwiseAffine"
  bottom: "res1_branch2a"
  top: "res1_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "res1_branch2a_relu"
  type: "ReLU"
  bottom: "res1_branch2a"
  top: "res1_branch2a"
}
layer {
  name: "res1_branch2b"
  type: "Convolution"
  bottom: "res1_branch2a"
  top: "res1_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn1_branch2b"
  type: "BatchNorm"
  bottom: "res1_branch2b"
  top: "res1_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "scale1_branch2b"
  type: "EltwiseAffine"
  bottom: "res1_branch2b"
  top: "res1_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "res1_branch2b_relu"
  type: "ReLU"
  bottom: "res1_branch2b"
  top: "res1_branch2b"
}
layer {
  name: "res1_branch2c"
  type: "Convolution"
  bottom: "res1_branch2b"
  top: "res1_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res1"
  type: "Eltwise"
  bottom: "res1_branch1"
  bottom: "res1_branch2c"
  top: "res1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "res1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "pool1_bn"
  type: "BatchNorm"
  bottom: "pool1"
  top: "pool1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "pool1_bn_scale"
  type: "EltwiseAffine"
  bottom: "pool1_bn"
  top: "pool1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "pool1_bn_scale_relu"
  type: "ReLU"
  bottom: "pool1_bn"
  top: "pool1_bn"
}
layer {
  name: "res4_branch2a"
  type: "Convolution"
  bottom: "pool1_bn"
  top: "res4_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn4_branch2a"
  type: "BatchNorm"
  bottom: "res4_branch2a"
  top: "res4_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "scale4_branch2a"
  type: "EltwiseAffine"
  bottom: "res4_branch2a"
  top: "res4_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "res4_branch2a_relu"
  type: "ReLU"
  bottom: "res4_branch2a"
  top: "res4_branch2a"
}
layer {
  name: "res4_branch2b"
  type: "Convolution"
  bottom: "res4_branch2a"
  top: "res4_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn4_branch2b"
  type: "BatchNorm"
  bottom: "res4_branch2b"
  top: "res4_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "scale4_branch2b"
  type: "EltwiseAffine"
  bottom: "res4_branch2b"
  top: "res4_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "res4_branch2b_relu"
  type: "ReLU"
  bottom: "res4_branch2b"
  top: "res4_branch2b"
}
layer {
  name: "res4_branch2c"
  type: "Convolution"
  bottom: "res4_branch2b"
  top: "res4_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res4"
  type: "Eltwise"
  bottom: "pool1"
  bottom: "res4_branch2c"
  top: "res4"
}
layer {
  name: "res6_branch1"
  type: "Convolution"
  bottom: "res4"
  top: "res6_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res4_bn"
  type: "BatchNorm"
  bottom: "res4"
  top: "res4_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "res4_bn_scale"
  type: "EltwiseAffine"
  bottom: "res4_bn"
  top: "res4_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "res4_bn_scale_relu"
  type: "ReLU"
  bottom: "res4_bn"
  top: "res4_bn"
}
layer {
  name: "res6_branch2a"
  type: "Convolution"
  bottom: "res4_bn"
  top: "res6_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn6_branch2a"
  type: "BatchNorm"
  bottom: "res6_branch2a"
  top: "res6_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "scale6_branch2a"
  type: "EltwiseAffine"
  bottom: "res6_branch2a"
  top: "res6_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "res6_branch2a_relu"
  type: "ReLU"
  bottom: "res6_branch2a"
  top: "res6_branch2a"
}
layer {
  name: "res6_branch2b"
  type: "Convolution"
  bottom: "res6_branch2a"
  top: "res6_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn6_branch2b"
  type: "BatchNorm"
  bottom: "res6_branch2b"
  top: "res6_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "scale6_branch2b"
  type: "EltwiseAffine"
  bottom: "res6_branch2b"
  top: "res6_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "res6_branch2b_relu"
  type: "ReLU"
  bottom: "res6_branch2b"
  top: "res6_branch2b"
}
layer {
  name: "res6_branch2c"
  type: "Convolution"
  bottom: "res6_branch2b"
  top: "res6_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res6"
  type: "Eltwise"
  bottom: "res6_branch1"
  bottom: "res6_branch2c"
  top: "res6"
}
layer {
  name: "res6_bn"
  type: "BatchNorm"
  bottom: "res6"
  top: "res6_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "res6_bn_scale"
  type: "EltwiseAffine"
  bottom: "res6_bn"
  top: "res6_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "res6_bn_scale_relu"
  type: "ReLU"
  bottom: "res6_bn"
  top: "res6_bn"
}
layer {
  name: "reshg1_up1_branch2a"
  type: "Convolution"
  bottom: "res6_bn"
  top: "reshg1_up1_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bnhg1_up1_branch2a"
  type: "BatchNorm"
  bottom: "reshg1_up1_branch2a"
  top: "reshg1_up1_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "scalehg1_up1_branch2a"
  type: "EltwiseAffine"
  bottom: "reshg1_up1_branch2a"
  top: "reshg1_up1_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "reshg1_up1_branch2a_relu"
  type: "ReLU"
  bottom: "reshg1_up1_branch2a"
  top: "reshg1_up1_branch2a"
}
layer {
  name: "reshg1_up1_branch2b"
  type: "Convolution"
  bottom: "reshg1_up1_branch2a"
  top: "reshg1_up1_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bnhg1_up1_branch2b"
  type: "BatchNorm"
  bottom: "reshg1_up1_branch2b"
  top: "reshg1_up1_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "scalehg1_up1_branch2b"
  type: "EltwiseAffine"
  bottom: "reshg1_up1_branch2b"
  top: "reshg1_up1_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "reshg1_up1_branch2b_relu"
  type: "ReLU"
  bottom: "reshg1_up1_branch2b"
  top: "reshg1_up1_branch2b"
}
layer {
  name: "reshg1_up1_branch2c"
  type: "Convolution"
  bottom: "reshg1_up1_branch2b"
  top: "reshg1_up1_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "reshg1_up1"
  type: "Eltwise"
  bottom: "res6"
  bottom: "reshg1_up1_branch2c"
  top: "reshg1_up1"
}
layer {
  name: "reshg1_up2_branch1"
  type: "Convolution"
  bottom: "reshg1_up1"
  top: "reshg1_up2_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "reshg1_up1_bn"
  type: "BatchNorm"
  bottom: "reshg1_up1"
  top: "reshg1_up1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "reshg1_up1_bn_scale"
  type: "EltwiseAffine"
  bottom: "reshg1_up1_bn"
  top: "reshg1_up1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "reshg1_up1_bn_scale_relu"
  type: "ReLU"
  bottom: "reshg1_up1_bn"
  top: "reshg1_up1_bn"
}
layer {
  name: "reshg1_up2_branch2a"
  type: "Convolution"
  bottom: "reshg1_up1_bn"
  top: "reshg1_up2_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bnhg1_up2_branch2a"
  type: "BatchNorm"
  bottom: "reshg1_up2_branch2a"
  top: "reshg1_up2_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
    eps: 1e-05
  }
}
layer {
  name: "scalehg1_up2_branch2a"
  type: "EltwiseAffine"
  bottom: "reshg1_up2_branch2a"
  top: "reshg1_up2_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  eltwise_affine_param {
    channel_shared: false
  }
}
layer {
  name: "reshg1_up2_branch2a_relu"
  type: "ReLU"
  bottom: "reshg1_up2_branch2a"
  top: "reshg1_up2_branch2a"
}
layer {
  name: "reshg1_up2_branch2b"
  type: "Convolution"
  bottom: "reshg1_up2_branch2a"
  top: "reshg1_up2_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
